&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    ЗаписатьЗаявкуНаСервере(ПараметрКоманды);
    ОбновитьИнтерфейс();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗаявкуНаСервере(ЗаявкаНаОнбординг)
    ЗаявкаНаОнбордингОбъект = ЗаявкаНаОнбординг.ПолучитьОбъект();
    ЗаявкаНаОнбордингОбъект.Статус = Перечисления.otus_СтатусыЗаявкиОнбординга.ВРаботе;
    ЗаявкаНаОнбордингОбъект.ДатаОтправкиВРаботу = ТекущаяДатаСеанса();
    ЗаявкаНаОнбордингОбъект.Записать(РежимЗаписиДокумента.Проведение);
    
    ОтправитьВRMQ(ЗаявкаНаОнбординг);
    
КонецПроцедуры

Процедура ОтправитьВRMQ(ЗаявкаНаОнбординг)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   Otus_ЭтапыОнбординга.Заявка КАК Заявка,
        |   Otus_ЭтапыОнбординга.ТипЭтапа КАК ТипЭтапа,
        |   Otus_ЭтапыОнбординга.НомерЭтапа КАК НомерЭтапа,
        |   Otus_ЭтапыОнбординга.СтатусЭтапа КАК СтатусЭтапа,
        |   Otus_ЭтапыОнбординга.Дедлайн КАК Дедлайн,
        |   Otus_ЭтапыОнбординга.ДатаФакта КАК ДатаФакта,
        |   Otus_ЭтапыОнбординга.Просрочен КАК Просрочен,
        |   Otus_ЭтапыОнбординга.CorrelationId КАК CorrelationId,
        |   Otus_ЭтапыОнбординга.LastRequestId КАК LastRequestId,
        |   Otus_ЭтапыОнбординга.ДатаОтправки КАК ДатаОтправки,
        |   Otus_ЭтапыОнбординга.ДатаОтвета КАК ДатаОтвета,
        |   Otus_ЭтапыОнбординга.РезультатТекст КАК РезультатТекст,
        |   Otus_ЭтапыОнбординга.ОшибкаКод КАК ОшибкаКод,
        |   Otus_ЭтапыОнбординга.ОшибкаТекст КАК ОшибкаТекст
        |ИЗ
        |   РегистрСведений.Otus_ЭтапыОнбординга КАК Otus_ЭтапыОнбординга
        |ГДЕ
        |   Otus_ЭтапыОнбординга.Заявка = &Заявка
        |   И Otus_ЭтапыОнбординга.СтатусЭтапа = ЗНАЧЕНИЕ(Перечисление.otus_СтатусыЭтапаОнбординга.Ожидает)";
    
    Запрос.УстановитьПараметр("Заявка", ЗаявкаНаОнбординг);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    СтруктураСообщения = Новый Структура("message_type, correlation_id, request_id, sent_at, employee, payload, request_id, message_type");
    
    ГУИДКомпоненты = Новый УникальныйИдентификатор();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        
        ЗаполнитьЗначенияСвойств(СтруктураСообщения, ВыборкаДетальныеЗаписи);
        СтруктураСообщения.request_id = Строка(Новый УникальныйИдентификатор);
        СтруктураСообщения.message_type = ВыборкаДетальныеЗаписи.ТипЭтапа.ТипКомандыRMQ; 
        СтруктураСообщения.sent_at = ТекущаяДатаСеанса();
        СтруктураСообщения.employee = СтруктураСотрудника(ВыборкаДетальныеЗаписи.Заявка.Сотрудник);
        СтруктураСообщения.payload = СтруктураВыдачи(ВыборкаДетальныеЗаписи.ТипЭтапа);
        СтруктураСообщения.correlation_id = ВыборкаДетальныеЗаписи.CorrelationId;
        
        СтруктураОтветаJSON = Новый ЗаписьJSON;
        СтруктураОтветаJSON.УстановитьСтроку();
        ЗаписатьJSON(СтруктураОтветаJSON, СтруктураСообщения);
        
        ТекстСообщения = СтруктураОтветаJSON.Закрыть();
        
        ОбновитьДвиженияРегистра_Otus_ЭтапыОнбординга(ВыборкаДетальныеЗаписи, СтруктураСообщения);
        
        ОтправитьСообщение(ТекстСообщения, ГУИДКомпоненты);
        
    КонецЦикла;
    
КонецПроцедуры

Функция СтруктураСотрудника(Сотрудник)
    
    Результат = Новый Структура();
    Результат.Вставить("id", Сотрудник.Код);
    Результат.Вставить("full_name", Сотрудник.Наименование);
    Результат.Вставить("department", Сотрудник.Подразделение);
    Результат.Вставить("position", Сотрудник.Должность);
    
    Возврат Результат;
    
КонецФункции


Функция СтруктураВыдачи(ТипЭтапа)
    
    Результат = Новый Соответствие();
    Если ТипЗнч(ТипЭтапа.ЧтоПредоставить) = Тип("Строка") Тогда
        Результат.Вставить(ТипЭтапа.ТипКомандыRMQ, ТипЭтапа.ЧтоПредоставить);
    Иначе
        Результат.Вставить(ТипЭтапа.ТипКомандыRMQ, ТипЭтапа.ЧтоПредоставить.Наименование);
        Результат.Вставить("asset_tag", ТипЭтапа.ЧтоПредоставить.ИнвНомер);
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции

Процедура ОбновитьДвиженияРегистра_Otus_ЭтапыОнбординга(СтарыеДанные, ДанныеЗаписи)
    Набор = РегистрыСведений.Otus_ЭтапыОнбординга.СоздатьНаборЗаписей();
    Набор.Отбор.Заявка.Установить(СтарыеДанные.Заявка);
    Набор.Отбор.ТипЭтапа.Установить(СтарыеДанные.ТипЭтапа);
    Набор.Отбор.НомерЭтапа.Установить(СтарыеДанные.НомерЭтапа);
    Набор.Прочитать();
    Если Набор.Количество() Тогда
        Запись = Набор[0];
        Запись.СтатусЭтапа = Перечисления.otus_СтатусыЭтапаОнбординга.Отправлено;
        Запись.LastRequestId = ДанныеЗаписи.request_id;
        Запись.ДатаОтправки = ДанныеЗаписи.sent_at;
        Набор.Записать();
    КонецЕсли;
КонецПроцедуры

Процедура ОтправитьСообщение(ТекстСообщения, ГУИДКомпоненты)
    Сервер = Онбординг_RMQ.ПолучитьПараметрыСервераRMQ();
	Exchange = Новый Структура("ТочкаОбмена, КлючМаршрутизации", "", "hr.onboarding.commands");
    КлиентКомпоненты  = Онбординг_RMQ.ПолучитьКомпонентуСервер(ГУИДКомпоненты);
	Онбординг_RMQ.ОтправитьСообщение(КлиентКомпоненты, Сервер, Exchange, ТекстСообщения);
КонецПроцедуры