
&НаСервере
Процедура ОтправитьВРаботуНаСервере(ЗаявкаОнбординг)
    Если ЗначениеЗаполнено(ЗаявкаОнбординг.Проведен) Тогда
        
    Иначе
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Перед отправкой документа в работу необходимо выполнить его проведение!'", "ru"));
        Возврат;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВРаботу(Команда)
    Если ЭтотОбъект.ПроверитьЗаполнение() Тогда
        ОтправитьВРаботуНаСервере(Объект.Ссылка);
    Иначе
        ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить все обязательные поля документа!'"));
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ОтменитьЗаявкуНаСервере()
    // Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗаявку(Команда)
    ОтменитьЗаявкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если ЗначениеЗаполнено(Объект.Ссылка)
        И Объект.Статус = Перечисления.otus_СтатусыЗаявкиОнбординга.ВРаботе
        Или Объект.Статус = Перечисления.otus_СтатусыЗаявкиОнбординга.Звершено
        Или Объект.Статус = Перечисления.otus_СтатусыЗаявкиОнбординга.Отменено Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Сотрудник", "ТолькоПросмотр", Истина);
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаВыхода", "ТолькоПросмотр", Истина);
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НужноОборудование", "ТолькоПросмотр", Истина);
    КонецЕсли;
КонецПроцедуры



