#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
   ЮТТесты.ДобавитьТестовыйНабор("Общий модуль Онбординг RMQ: Работа с компонентой PinkRMQ").ВТранзакции() 
  	.ДобавитьТест("ПроверкаПолученияНастроекСервераRMQЭтоСтруктураПозитив")
    .ДобавитьТест("ПроверкаПолученияНастроекСервераRMQЗаполненАдресПозитив")
    .ДобавитьТест("ПроверкаПолученияНастроекСервераRMQЗаполненПортПозитив")
    .ДобавитьТест("ПроверкаПолученияНастроекСервераRMQЗаполненЛогинПозитив")
    .ДобавитьТест("ПроверкаПолученияНастроекСервераRMQЗаполненПарольПозитив")
    .ДобавитьТест("ПроверкаПолученияНастроекСервераRMQЗаполненВиртуальныйПортПозитив")
    .ДобавитьТест("ПроверкаПолученияНастроекСервераRMQЗаполненАдресНегатив")
    .ДобавитьТест("ПроверкаПолученияНастроекСервераRMQЗаполненПортНегатив")
    .ДобавитьТест("ПроверкаПолученияНастроекСервераRMQЗаполненЛогинНегатив")
    .ДобавитьТест("ПроверкаПолученияНастроекСервераRMQЗаполненПарольНегатив")
    .ДобавитьТест("ПроверкаПолученияНастроекСервераRMQЗаполненВиртуальныйПортНегатив")
    .ДобавитьТест("ПроверкаПолученияНастроекСервераRMQАдресКорректныйПозитив")
    .ДобавитьТест("ПроверкаПолученияНастроекСервераRMQПортКорректныйПозитив")
    .ДобавитьТест("ПроверкаПолученияНастроекСервераRMQЛогинКорректныйПозитив")
    .ДобавитьТест("ПроверкаПолученияНастроекСервераRMQВиртуальныйПортКорректныйПозитив")
    .ДобавитьТест("ПроверкаПолученияНастроекСервераRMQАдресКорректныйНегатив")
    .ДобавитьТест("ПроверкаПолученияНастроекСервераRMQПортКорректныйНегатив")
    .ДобавитьТест("ПроверкаПолученияНастроекСервераRMQЛогинКорректныйНегатив")
    .ДобавитьТест("ПроверкаПолученияНастроекСервераRMQВиртуальныйПортКорректныйНегатив")
	;

КонецПроцедуры 

Процедура ПроверкаПолученияНастроекСервераRMQЭтоСтруктураПозитив() Экспорт
	
    СтруктураПараметров = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", Константы.RMQ_Хост.Получить(), 
    Константы.RMQ_Порт.Получить(), 
    Константы.RMQ_Пользователь.Получить(), 
    Константы.RMQ_Пароль.Получить(), 
    Константы.RMQ_VHost.Получить());
    
	Ютест.ОжидаетЧто(СтруктураПараметров)
	.ИмеетТип("Структура")

КонецПроцедуры   

Процедура ПроверкаПолученияНастроекСервераRMQЗаполненАдресПозитив() Экспорт
	
    СтруктураПараметров = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", Константы.RMQ_Хост.Получить(), 
    Константы.RMQ_Порт.Получить(), 
    Константы.RMQ_Пользователь.Получить(), 
    Константы.RMQ_Пароль.Получить(), 
    Константы.RMQ_VHost.Получить());
    
	Ютест.ОжидаетЧто(СтруктураПараметров)
	.Заполнено()
    .Свойство("Адрес").Заполнено()

КонецПроцедуры 

Процедура ПроверкаПолученияНастроекСервераRMQЗаполненПортПозитив() Экспорт
	
    СтруктураПараметров = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", Константы.RMQ_Хост.Получить(), 
    Константы.RMQ_Порт.Получить(), 
    Константы.RMQ_Пользователь.Получить(), 
    Константы.RMQ_Пароль.Получить(), 
    Константы.RMQ_VHost.Получить());
    
	Ютест.ОжидаетЧто(СтруктураПараметров)
	.Заполнено()
    .Свойство("Порт").Заполнено()

КонецПроцедуры 

Процедура ПроверкаПолученияНастроекСервераRMQЗаполненЛогинПозитив() Экспорт
	
    СтруктураПараметров = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", Константы.RMQ_Хост.Получить(), 
    Константы.RMQ_Порт.Получить(), 
    Константы.RMQ_Пользователь.Получить(), 
    Константы.RMQ_Пароль.Получить(), 
    Константы.RMQ_VHost.Получить());
    
	Ютест.ОжидаетЧто(СтруктураПараметров)
	.Заполнено()
    .Свойство("Логин").Заполнено()

КонецПроцедуры 

Процедура ПроверкаПолученияНастроекСервераRMQЗаполненПарольПозитив() Экспорт
	
    СтруктураПараметров = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", Константы.RMQ_Хост.Получить(), 
    Константы.RMQ_Порт.Получить(), 
    Константы.RMQ_Пользователь.Получить(), 
    Константы.RMQ_Пароль.Получить(), 
    Константы.RMQ_VHost.Получить());
    
	Ютест.ОжидаетЧто(СтруктураПараметров)
	.Заполнено()
    .Свойство("Пароль").Заполнено()

КонецПроцедуры 

Процедура ПроверкаПолученияНастроекСервераRMQЗаполненВиртуальныйПортПозитив() Экспорт
	
    СтруктураПараметров = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", Константы.RMQ_Хост.Получить(), 
    Константы.RMQ_Порт.Получить(), 
    Константы.RMQ_Пользователь.Получить(), 
    Константы.RMQ_Пароль.Получить(), 
    Константы.RMQ_VHost.Получить());
    
	Ютест.ОжидаетЧто(СтруктураПараметров)
	.Заполнено()
    .Свойство("ВиртуальныйХост").Заполнено()

КонецПроцедуры

Процедура ПроверкаПолученияНастроекСервераRMQЗаполненАдресНегатив() Экспорт
	
    СтруктураПараметров = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", , 
    Константы.RMQ_Порт.Получить(), 
    Константы.RMQ_Пользователь.Получить(), 
    Константы.RMQ_Пароль.Получить(), 
    Константы.RMQ_VHost.Получить());
    
	Ютест.ОжидаетЧто(СтруктураПараметров)
	.Заполнено()
    .Свойство("Адрес").НеЗаполнено()

КонецПроцедуры 

Процедура ПроверкаПолученияНастроекСервераRMQЗаполненПортНегатив() Экспорт
	
    СтруктураПараметров = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", Константы.RMQ_Хост.Получить(), 
    , 
    Константы.RMQ_Пользователь.Получить(), 
    Константы.RMQ_Пароль.Получить(), 
    Константы.RMQ_VHost.Получить());
    
	Ютест.ОжидаетЧто(СтруктураПараметров)
	.Заполнено()
    .Свойство("Порт").НеЗаполнено()

КонецПроцедуры 

Процедура ПроверкаПолученияНастроекСервераRMQЗаполненЛогинНегатив() Экспорт
	
    СтруктураПараметров = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", Константы.RMQ_Хост.Получить(), 
    Константы.RMQ_Порт.Получить(), 
    , 
    Константы.RMQ_Пароль.Получить(), 
    Константы.RMQ_VHost.Получить());
    
	Ютест.ОжидаетЧто(СтруктураПараметров)
	.Заполнено()
    .Свойство("Логин").НеЗаполнено()

КонецПроцедуры 

Процедура ПроверкаПолученияНастроекСервераRMQЗаполненПарольНегатив() Экспорт
	
    СтруктураПараметров = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", Константы.RMQ_Хост.Получить(), 
    Константы.RMQ_Порт.Получить(), 
    Константы.RMQ_Пользователь.Получить(), 
    , 
    Константы.RMQ_VHost.Получить());
    
	Ютест.ОжидаетЧто(СтруктураПараметров)
	.Заполнено()
    .Свойство("Пароль").НеЗаполнено()

КонецПроцедуры 

Процедура ПроверкаПолученияНастроекСервераRMQЗаполненВиртуальныйПортНегатив() Экспорт
	
    СтруктураПараметров = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", Константы.RMQ_Хост.Получить(), 
    Константы.RMQ_Порт.Получить(), 
    Константы.RMQ_Пользователь.Получить(), 
    Константы.RMQ_Пароль.Получить(), 
    );
    
	Ютест.ОжидаетЧто(СтруктураПараметров)
	.Заполнено()
    .Свойство("ВиртуальныйХост").НеЗаполнено()

КонецПроцедуры


//////
Процедура ПроверкаПолученияНастроекСервераRMQАдресКорректныйПозитив() Экспорт
	
    СтруктураПараметров = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", "rabbitmq.lab.home.arpa", 
    Константы.RMQ_Порт.Получить(), 
    Константы.RMQ_Пользователь.Получить(), 
    Константы.RMQ_Пароль.Получить(), 
    Константы.RMQ_VHost.Получить());
    
	Ютест.ОжидаетЧто(СтруктураПараметров)
	 .Свойство("Адрес").Равно(Константы.RMQ_Хост.Получить())

КонецПроцедуры 

Процедура ПроверкаПолученияНастроекСервераRMQПортКорректныйПозитив() Экспорт
	
    СтруктураПараметров = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", Константы.RMQ_Хост.Получить(), 
    5672, 
    Константы.RMQ_Пользователь.Получить(), 
    Константы.RMQ_Пароль.Получить(), 
    Константы.RMQ_VHost.Получить());
    
	Ютест.ОжидаетЧто(СтруктураПараметров)
	 .Свойство("Порт").Равно(Константы.RMQ_Порт.Получить())

КонецПроцедуры 

Процедура ПроверкаПолученияНастроекСервераRMQЛогинКорректныйПозитив() Экспорт
	
    СтруктураПараметров = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", Константы.RMQ_Хост.Получить(), 
    Константы.RMQ_Порт.Получить(), 
    "onboarding", 
    Константы.RMQ_Пароль.Получить(), 
    Константы.RMQ_VHost.Получить());
    
	Ютест.ОжидаетЧто(СтруктураПараметров)
	 .Свойство("Логин").Равно(Константы.RMQ_Пользователь.Получить())
    

КонецПроцедуры 

Процедура ПроверкаПолученияНастроекСервераRMQВиртуальныйПортКорректныйПозитив() Экспорт
	
    СтруктураПараметров = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", Константы.RMQ_Хост.Получить(), 
    Константы.RMQ_Порт.Получить(), 
    Константы.RMQ_Пользователь.Получить(), 
    Константы.RMQ_Пароль.Получить(), 
    "hr_onboarding");
    
	Ютест.ОжидаетЧто(СтруктураПараметров)
	 .Свойство("ВиртуальныйХост").Равно(Константы.RMQ_VHost.Получить())

 КонецПроцедуры
 
 Процедура ПроверкаПолученияНастроекСервераRMQАдресКорректныйНегатив() Экспорт
	
    СтруктураПараметров = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", "rabbitmq.lab.home.arpa1", 
    Константы.RMQ_Порт.Получить(), 
    Константы.RMQ_Пользователь.Получить(), 
    Константы.RMQ_Пароль.Получить(), 
    Константы.RMQ_VHost.Получить());
    
	Ютест.ОжидаетЧто(СтруктураПараметров)
	 .Свойство("Адрес").НеРавно(Константы.RMQ_Хост.Получить())

КонецПроцедуры 

Процедура ПроверкаПолученияНастроекСервераRMQПортКорректныйНегатив() Экспорт
	
    СтруктураПараметров = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", Константы.RMQ_Хост.Получить(), 
    56721, 
    Константы.RMQ_Пользователь.Получить(), 
    Константы.RMQ_Пароль.Получить(), 
    Константы.RMQ_VHost.Получить());
    
	Ютест.ОжидаетЧто(СтруктураПараметров)
	 .Свойство("Порт").НеРавно(Константы.RMQ_Порт.Получить())

КонецПроцедуры 

Процедура ПроверкаПолученияНастроекСервераRMQЛогинКорректныйНегатив() Экспорт
	
    СтруктураПараметров = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", Константы.RMQ_Хост.Получить(), 
    Константы.RMQ_Порт.Получить(), 
    "onboarding1", 
    Константы.RMQ_Пароль.Получить(), 
    Константы.RMQ_VHost.Получить());
    
	Ютест.ОжидаетЧто(СтруктураПараметров)
	 .Свойство("Логин").НеРавно(Константы.RMQ_Пользователь.Получить())
    

КонецПроцедуры 

Процедура ПроверкаПолученияНастроекСервераRMQВиртуальныйПортКорректныйНегатив() Экспорт
	
    СтруктураПараметров = Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", Константы.RMQ_Хост.Получить(), 
    Константы.RMQ_Порт.Получить(), 
    Константы.RMQ_Пользователь.Получить(), 
    Константы.RMQ_Пароль.Получить(), 
    "hr_onboarding1");
    
	Ютест.ОжидаетЧто(СтруктураПараметров)
	 .Свойство("ВиртуальныйХост").НеРавно(Константы.RMQ_VHost.Получить())

КонецПроцедуры


#КонецОбласти