Процедура ЗаполнитьЭтапыОнбординга() Экспорт
     Если ЭтотОбъект.Статус <> Перечисления.otus_СтатусыЗаявкиОнбординга.ВРаботе И
        ЭтотОбъект.Статус <> Перечисления.otus_СтатусыЗаявкиОнбординга.Звершено Тогда
        
            Заявка = ЭтотОбъект.Ссылка;
            Набор = РегистрыСведений.Otus_ЭтапыОнбординга.СоздатьНаборЗаписей();
            Отбор = Набор.Отбор.Заявка;
            
            Отбор.Установить(Заявка);
            Набор.Очистить();
            
            Если ЭтотОбъект.НужноОборудование Тогда
                
                ЕстьЭтапОборудование = ЭтотОбъект.ПакетДоступов.Этапы.НайтиСтроки(Новый Структура("ТипЭтапа", Справочники.otus_ТипыЭтапов.Оборудование)).Количество();
                
                Если Не ЕстьЭтапОборудование Тогда
                    
                    НовыеДанные = Набор.Добавить();
                    НовыеДанные.Заявка = Заявка;
                    НовыеДанные.ТипЭтапа = Справочники.otus_ТипыЭтапов.Оборудование;
                    НовыеДанные.НомерЭтапа = 99;
                    НовыеДанные.СтатусЭтапа = Перечисления.otus_СтатусыЭтапаОнбординга.Ожидает;
                    НовыеДанные.Дедлайн = ТекущаяДатаСеанса() + 48 * 60;
                    НовыеДанные.CorrelationId = Строка(Новый УникальныйИдентификатор);
                    
                    Набор.Записать();     
                КонецЕсли;
            КонецЕсли;
            
            Для Каждого Этап Из ЭтотОбъект.ПакетДоступов.Этапы Цикл
                
                НовыеДанные = Набор.Добавить();
                НовыеДанные.Заявка = Заявка;
                НовыеДанные.ТипЭтапа = Этап.ТипЭтапа;
                НовыеДанные.НомерЭтапа = Этап.Порядок;
                НовыеДанные.СтатусЭтапа = Перечисления.otus_СтатусыЭтапаОнбординга.Ожидает;
                НовыеДанные.Дедлайн = ТекущаяДатаСеанса() + Этап.SLAЧасов * 3600;
                НовыеДанные.CorrelationId = Строка(Новый УникальныйИдентификатор);
                
                Набор.Записать(); 
                
            КонецЦикла;
            
            
        КонецЕсли;
    КонецПроцедуры
    
Процедура ПриЗаписи(Отказ)
    ЗаполнитьЭтапыОнбординга();
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
    ЭтотОбъект.Статус = Перечисления.otus_СтатусыЗаявкиОнбординга.Черновик;
КонецПроцедуры

