#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
   ЮТТесты.ДобавитьТестовыйНабор("Документ ""Заявка онбординг"": Проверка проведения").ВТранзакции() 
  	.ДобавитьТест("ПроверкаЗаписиПозитив")
   	.ДобавитьТест("ПроверкаЗаписиНегатив")
  	.ДобавитьТест("ПроверкаПроведенияПозитив")
   	.ДобавитьТест("ПроверкаПроведенияНегатив")
	;

КонецПроцедуры 

Процедура ПроверкаЗаписиПозитив() Экспорт
	
	otus_ЗаявкаОнбординг = Ютест.Данные().КонструкторОбъекта("Документы.otus_ЗаявкаОнбординг")
	.ФикцияОбязательныхПолей()
	.ФикцияРеквизитов("Комментарий")
	.Установить("Дата", ТекущаяДатаСеанса())
	.Записать()
	;
	
	Ютест.ОжидаетЧто(otus_ЗаявкаОнбординг.ПолучитьОбъект())
	.Метод("Записать")
  	.НеВыбрасываетИсключение()


КонецПроцедуры   

Процедура ПроверкаЗаписиНегатив() Экспорт

	otus_ЗаявкаОнбординг = Ютест.Данные().КонструкторОбъекта("Документы.otus_ЗаявкаОнбординг")
	.Установить("Дата", ТекущаяДатаСеанса())
	;
	
	Ютест.ОжидаетЧто(otus_ЗаявкаОнбординг)
	.Метод("Записать") 
		.Параметр(РежимзаписиДокумента.Запись)
  	.ВыбрасываетИсключение("")
	;
  
КонецПроцедуры

Процедура ПроверкаПроведенияПозитив() Экспорт

	otus_ЗаявкаОнбординг = Ютест.Данные().КонструкторОбъекта("Документы.otus_ЗаявкаОнбординг")
	.ФикцияОбязательныхПолей()
	.ФикцияРеквизитов("Комментарий")
	.Установить("Дата", ТекущаяДатаСеанса())
	.Записать()
	;
	
	Ютест.ОжидаетЧто(otus_ЗаявкаОнбординг.ПолучитьОбъект())
		.Метод("Записать")
			.Параметр(РежимзаписиДокумента.Проведение)
			.Параметр(РежимПроведенияДокумента.Оперативный)
  	.НеВыбрасываетИсключение()
	;

КонецПроцедуры   

Процедура ПроверкаПроведенияНегатив() Экспорт
	
	otus_ЗаявкаОнбординг = Ютест.Данные().КонструкторОбъекта("Документы.otus_ЗаявкаОнбординг")
	.Установить("Дата", Дата("00010101"))
    .Установить("Сотрудник", Неопределено)
	.Записать()
	;
	                                         
	Ютест.ОжидаетЧто(otus_ЗаявкаОнбординг)
		.Метод("Записать")
			.Параметр(РежимзаписиДокумента.Проведение)
            .Параметр(РежимПроведенияДокумента.Оперативный)
  		.ВыбрасываетИсключение("")
	;

КонецПроцедуры

#КонецОбласти