
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    ЗаписатьЗаявкуНаСервере(ПараметрКоманды);
    ОбновитьИнтерфейс();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗаявкуНаСервере(ЗаявкаНаОнбординг)
    
    ОбновитьДвиженияРегистра_Otus_ЭтапыОнбординга(ЗаявкаНаОнбординг);
    
    ЗаявкаНаОнбордингОбъект = ЗаявкаНаОнбординг.ПолучитьОбъект();
    ЗаявкаНаОнбордингОбъект.Статус = Перечисления.otus_СтатусыЗаявкиОнбординга.Отменено;
    ЗаявкаНаОнбордингОбъект.Записать(РежимЗаписиДокумента.Проведение);
    
    
КонецПроцедуры

Процедура ОбновитьДвиженияРегистра_Otus_ЭтапыОнбординга(ЗаявкаНаОнбординг)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   Otus_ЭтапыОнбординга.Заявка КАК Заявка,
        |   Otus_ЭтапыОнбординга.ТипЭтапа КАК ТипЭтапа,
        |   Otus_ЭтапыОнбординга.НомерЭтапа КАК НомерЭтапа,
        |   Otus_ЭтапыОнбординга.СтатусЭтапа КАК СтатусЭтапа,
        |   Otus_ЭтапыОнбординга.Дедлайн КАК Дедлайн,
        |   Otus_ЭтапыОнбординга.ДатаФакта КАК ДатаФакта,
        |   Otus_ЭтапыОнбординга.Просрочен КАК Просрочен,
        |   Otus_ЭтапыОнбординга.CorrelationId КАК CorrelationId,
        |   Otus_ЭтапыОнбординга.LastRequestId КАК LastRequestId,
        |   Otus_ЭтапыОнбординга.ДатаОтправки КАК ДатаОтправки,
        |   Otus_ЭтапыОнбординга.ДатаОтвета КАК ДатаОтвета,
        |   Otus_ЭтапыОнбординга.РезультатТекст КАК РезультатТекст,
        |   Otus_ЭтапыОнбординга.ОшибкаКод КАК ОшибкаКод,
        |   Otus_ЭтапыОнбординга.ОшибкаТекст КАК ОшибкаТекст
        |ИЗ
        |   РегистрСведений.Otus_ЭтапыОнбординга КАК Otus_ЭтапыОнбординга
        |ГДЕ
        |   Otus_ЭтапыОнбординга.Заявка = &ЗаявкаНаОнбординг";
    
    Запрос.УстановитьПараметр("ЗаявкаНаОнбординг", ЗаявкаНаОнбординг);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        Набор = РегистрыСведений.Otus_ЭтапыОнбординга.СоздатьНаборЗаписей();
        Набор.Отбор.Заявка.Установить(ВыборкаДетальныеЗаписи.Заявка);
        Набор.Отбор.ТипЭтапа.Установить(ВыборкаДетальныеЗаписи.ТипЭтапа);
        Набор.Отбор.НомерЭтапа.Установить(ВыборкаДетальныеЗаписи.НомерЭтапа);
        Набор.Прочитать();
        
        Если Набор.Количество() Тогда
            
            Запись = Набор[0];
            Запись.СтатусЭтапа = Перечисления.otus_СтатусыЭтапаОнбординга.Отменено;
            Набор.Записать();
            
        КонецЕсли;
        
    КонецЦикла;
    
КонецПроцедуры