
Процедура otus_ПолучитьСообщенияRMQ() Экспорт
    ГуидКомпоненты = Новый УникальныйИдентификатор();
    Сервер = Онбординг_RMQ.ПолучитьПараметрыСервераRMQ();
	Exchange = Новый Структура("ТочкаОбмена, ИмяОчереди", "", "hr.onboarding.replies");
    КлиентКомпоненты  = Онбординг_RMQ.ПолучитьКомпонентуСервер(ГУИДКомпоненты);
    Сообщение = "";
	Онбординг_RMQ.ПрочитатьСообщениеИзОчереди(КлиентКомпоненты, Сервер, Exchange);
    ОбновитьДвиженияРегистраRMQ();
    ЗакрытьСвязанныеЗаявки();
КонецПроцедуры

Процедура ОбновитьДвиженияРегистраRMQ() Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   RMQ_Сообщения.Ссылка КАК Ссылка,
        |   RMQ_Сообщения.Exchange КАК Exchange,
        |   RMQ_Сообщения.ТелоСообщения КАК ТелоСообщения
        |ИЗ
        |   Справочник.RMQ_Сообщения КАК RMQ_Сообщения
        |ГДЕ
        |   НЕ RMQ_Сообщения.Обработано";
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        ОбъектСообщение = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
        ТелоСообщения = ВыборкаДетальныеЗаписи.ТелоСообщения.Получить();
        СтруктураСообщения = СтрокуJSONВСтруктуру(ТелоСообщения);
               
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |   Otus_ЭтапыОнбординга.Заявка КАК Заявка,
        |   Otus_ЭтапыОнбординга.ТипЭтапа КАК ТипЭтапа,
        |   Otus_ЭтапыОнбординга.НомерЭтапа КАК НомерЭтапа,
        |   Otus_ЭтапыОнбординга.СтатусЭтапа КАК СтатусЭтапа,
        |   Otus_ЭтапыОнбординга.Дедлайн КАК Дедлайн,
        |   Otus_ЭтапыОнбординга.ДатаФакта КАК ДатаФакта,
        |   Otus_ЭтапыОнбординга.Просрочен КАК Просрочен,
        |   Otus_ЭтапыОнбординга.CorrelationId КАК CorrelationId,
        |   Otus_ЭтапыОнбординга.LastRequestId КАК LastRequestId,
        |   Otus_ЭтапыОнбординга.ДатаОтправки КАК ДатаОтправки,
        |   Otus_ЭтапыОнбординга.ДатаОтвета КАК ДатаОтвета,
        |   Otus_ЭтапыОнбординга.РезультатТекст КАК РезультатТекст,
        |   Otus_ЭтапыОнбординга.ОшибкаКод КАК ОшибкаКод,
        |   Otus_ЭтапыОнбординга.ОшибкаТекст КАК ОшибкаТекст
        |ИЗ
        |   РегистрСведений.Otus_ЭтапыОнбординга КАК Otus_ЭтапыОнбординга
        |ГДЕ
        |   Otus_ЭтапыОнбординга.CorrelationId = &CorrelationId";
        
        Запрос.УстановитьПараметр("CorrelationId", СтруктураСообщения.correlation_id);
        
        РезультатЗапроса = Запрос.Выполнить();
        
        ВыборкаЭтапы = РезультатЗапроса.Выбрать();
        
        Если ВыборкаЭтапы.Следующий() Тогда
            Набор = РегистрыСведений.Otus_ЭтапыОнбординга.СоздатьНаборЗаписей();
            Набор.Отбор.Заявка.Установить(ВыборкаЭтапы.Заявка);
            Набор.Отбор.ТипЭтапа.Установить(ВыборкаЭтапы.ТипЭтапа);
            Набор.Отбор.НомерЭтапа.Установить(ВыборкаЭтапы.НомерЭтапа);
            Набор.Прочитать();
            Если Набор.Количество() Тогда
                Запись = Набор[0];
                Запись.СтатусЭтапа = ?(ЗначениеЗаполнено(СтруктураСообщения.error), Перечисления.otus_СтатусыЭтапаОнбординга.Ошибка, Перечисления.otus_СтатусыЭтапаОнбординга.Выполнено);
                Запись.LastRequestId = СтруктураСообщения.request_id;
                Запись.ДатаОтвета = ПрочитатьДатуJSON(СтруктураСообщения.received_at, ФорматДатыJSON.ISO);
                Запись.Просрочен = Запись.ДатаОтвета > Запись.Дедлайн;
                Набор.Записать();
            КонецЕсли;
        КонецЕсли;
        
        СообщениеRMQ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
        СообщениеRMQ.Обработано = Истина;
        СообщениеRMQ.Записать();
        
    КонецЦикла;

КонецПроцедуры

Функция СформироватьСодержаниеЗадачи(СтруктураСообщения)
    
    Результат = "";
    
    Если СтруктураСообщения.message_type = "access_package" Тогда
        Результат = СтрШаблон(НСтр("ru='Создать ""%1"" для сотрудника %2(%3) из подразделения %4'", "ru"), 
        СтруктураСообщения.payload.access_package, СтруктураСообщения.employee.full_name, СтруктураСообщения.employee.id, СтруктураСообщения.employee.department);
    Иначе
        Результат = СтрШаблон(НСтр("ru='Выдать ""%1(%5)"" для сотрудника %2(%3) из подразделения %4'", "ru"), 
        СтруктураСообщения.payload.asset_issue, СтруктураСообщения.employee.full_name, СтруктураСообщения.employee.id, СтруктураСообщения.employee.department, СтруктураСообщения.payload.asset_tag);
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции

Функция СтрокуJSONВСтруктуру(Значение)

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Значение);

	Результат = ПрочитатьJSON(ЧтениеJSON);

	ЧтениеJSON.Закрыть();

	Возврат Результат;

КонецФункции

Процедура ЗакрытьСвязанныеЗаявки()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
        |   Otus_ЭтапыОнбординга.Заявка КАК Заявка
        |ПОМЕСТИТЬ ВТ_Заявки
        |ИЗ
        |   РегистрСведений.Otus_ЭтапыОнбординга КАК Otus_ЭтапыОнбординга
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   ВТ_Заявки.Заявка КАК Заявка
        |ПОМЕСТИТЬ ВТ_ОткрытыеЗаявки
        |ИЗ
        |   ВТ_Заявки КАК ВТ_Заявки
        |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Otus_ЭтапыОнбординга КАК Otus_ЭтапыОнбординга
        |       ПО ВТ_Заявки.Заявка = Otus_ЭтапыОнбординга.Заявка
        |ГДЕ
        |   Otus_ЭтапыОнбординга.СтатусЭтапа <> &СтатусЭтапаВыполнено
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   otus_ЗаявкаОнбординг.Ссылка КАК Ссылка
        |ИЗ
        |   Документ.otus_ЗаявкаОнбординг КАК otus_ЗаявкаОнбординг
        |ГДЕ
        |   НЕ otus_ЗаявкаОнбординг.Ссылка В
        |               (ВЫБРАТЬ
        |                   ВТ_ОткрытыеЗаявки.Заявка
        |               ИЗ
        |                   ВТ_ОткрытыеЗаявки)";
    
    Запрос.УстановитьПараметр("СтатусЭтапаВыполнено", Перечисления.otus_СтатусыЭтапаОнбординга.Выполнено);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        ЗаявкаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
        ЗаявкаОбъект.Статус = Перечисления.otus_СтатусыЗаявкиОнбординга.Звершено;
        ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
    КонецЦикла;

КонецПроцедуры