
&НаСервере
Процедура СписокПриАктивизацииСтрокиНаСервере(ЗаявкаНаОнбординг)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   Otus_ЭтапыОнбординга.ТипЭтапа КАК ЭтапПакета,
        |   Otus_ЭтапыОнбординга.СтатусЭтапа КАК СтатусЭтапа
        |ИЗ
        |   РегистрСведений.Otus_ЭтапыОнбординга КАК Otus_ЭтапыОнбординга
        |ГДЕ
        |   Otus_ЭтапыОнбординга.Заявка = &ЗаявкаНаОнбординг";
    
    Запрос.УстановитьПараметр("ЗаявкаНаОнбординг", ЗаявкаНаОнбординг);
    
    ЭтапыПакетовДоступа.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
    СписокПриАктивизацииСтрокиНаСервере(Элемент.ТекущаяСтрока);
КонецПроцедуры
